---
kind: property
id: P:Autodesk.Revit.DB.GridNode.UIndex
source: html/4913fa4f-e334-e751-d259-ceac85992dca.htm
---
# Autodesk.Revit.DB.GridNode.UIndex Property

The node's index along the U axis.

## Syntax (C#)
```csharp
public int UIndex { get; set; }
```